#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```

terraform
module.network.aws_vpc.vpc: Refreshing state... [id=vpc-036ede2188fe822b8]
module.network.aws_internet_gateway.igw: Refreshing state... [id=igw-0ac9a9002bdd045b7]
module.https_sg.aws_security_group.sg: Refreshing state... [id=sg-0679502cda57e36c2]
module.network.aws_subnet.private["ap-northeast-1a"]: Refreshing state... [id=subnet-096b3c54d4e0a6872]
module.network.aws_subnet.public["ap-northeast-1c"]: Refreshing state... [id=subnet-058faf506e28b7ed9]
module.network.aws_subnet.private["ap-northeast-1c"]: Refreshing state... [id=subnet-0a305ab5f27cd389d]
module.network.aws_subnet.public["ap-northeast-1a"]: Refreshing state... [id=subnet-0f5769fab850ba4bf]
module.network.aws_route_table.public: Refreshing state... [id=rtb-087a887da8415bdff]
module.network.aws_route.public: Refreshing state... [id=r-rtb-087a887da8415bdff1080289494]
module.https_sg.aws_security_group_rule.ingress: Refreshing state... [id=sgrule-277310025]
module.https_sg.aws_security_group_rule.egress: Refreshing state... [id=sgrule-1487212442]
module.network.aws_route_table_association.public["ap-northeast-1c"]: Refreshing state... [id=rtbassoc-0f6bf83bb9017e085]
module.network.aws_route_table_association.public["ap-northeast-1a"]: Refreshing state... [id=rtbassoc-03c2cb8006b96ede9]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb.aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "machamp-staging-alb"
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-058faf506e28b7ed9",
          + "subnet-0f5769fab850ba4bf",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.alb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "example"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-036ede2188fe822b8"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 60
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.http_sg.aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "http-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "machamp-staging-http-sg"
        }
      + tags_all               = {
          + "Name" = "machamp-staging-http-sg"
        }
      + vpc_id                 = "vpc-036ede2188fe822b8"
    }

  # module.http_sg.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.http_sg.aws_security_group_rule.ingress will be created
  + resource "aws_security_group_rule" "ingress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>